scripts/load-test/chat-traffic.yml
config:
  target: "{{ $processEnvironment.CONVEX_URL || $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Sustained chat traffic (5→50 req/s)"
  defaults:
    headers:
      Authorization: "Bearer {{ clerkToken }}"
      Content-Type: "application/json"
  http:
    timeout: 120
  payload:
    path: "scripts/load-test/test-users.csv"
    fields:
      - "userId"
      - "clerkToken"
    order: "random"
    skipHeader: true
    skipEmptyLines: true

# Targets Convex HTTP endpoints for chat mutations/queries.
# Each virtual user uses their own token from the pool to stay within
# per-user rate limits. Pro-plan users have unlimited chat.
#
# Note: chat assistant is a background action (not synchronous HTTP),
# so sendChatMessage returns immediately but the AI response arrives
# asynchronously via the Convex subscription.

scenarios:
  - name: "Chat Traffic"
    flow:
      - post:
          url: "/api/mutation/chat:sendChatMessage"
          json:
            content: "What skills should I highlight for a software engineering internship?"
      - think: 2
      - post:
          url: "/api/mutation/chat:sendChatMessage"
          json:
            content: "Can you review my resume bullet points and suggest improvements?"
      - think: 5
      - post:
          url: "/api/query/chat:getChatHistory"
          json: {}