scripts/load-test/create-job-burst.yml
config:
  target: "{{ $processEnvironment.CONVEX_URL || $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 5
      arrivalRate: 400
      rampTo: 2000
      name: "Burst to 2k concurrent (placement drive)"
  defaults:
    headers:
      Authorization: "Bearer {{ clerkToken }}"
      Content-Type: "application/json"
  http:
    timeout: 120
  payload:
    path: "scripts/load-test/test-users.csv"
    fields:
      - "userId"
      - "clerkToken"
    order: "random"
    skipHeader: true
    skipEmptyLines: true

# Targets Convex HTTP mutation endpoint for createJob.
# Each virtual user sends an idempotencyKey so retries don't create duplicates.
# With 2k users hitting the same JD, Phase 1c JD-hash caching ensures only
# the first request triggers the full LLM pipeline — all subsequent requests
# hit the cache and return immediately.

scenarios:
  - name: "Placement Drive — Bulk createJob"
    flow:
      - post:
          url: "/api/mutation/jobs:createJob"
          json:
            companyName: "LoadTest Corp"
            jobTitle: "Software Engineer Intern"
            rawJdText: |
              We are looking for a Software Engineer Intern to join our engineering team.
              Required skills: JavaScript, TypeScript, React, Node.js, Python.
              Nice to have: Docker, AWS, PostgreSQL, Redis, GraphQL.
              The ideal candidate has strong problem-solving skills and experience
              building full-stack applications. Familiarity with CI/CD pipelines
              and cloud infrastructure is a plus.
            inputType: "text"
            idempotencyKey: "{{ $randomString(32) }}"
          capture:
            - json: "$.value"
              as: "jobId"