scripts/load-test/dashboard-load.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'https://dynamic-warthog-953.convex.cloud' }}"
  phases:
    - duration: 10
      arrivalRate: 100
      rampTo: 1000
      name: "Ramp up to 1k users/sec (10k concurrent)"
    - duration: 30
      arrivalRate: 1000
      name: "Sustain 1k users/sec for 30s"
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.CLERK_TOKEN || 'test-token' }}"
      Content-Type: "application/json"
  http:
    timeout: 30
  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 5000
  environments:
    production:
      target: "https://moonlit-panda-300.convex.cloud"

# Convex exposes HTTP endpoints for all functions:
#   POST /api/query/<function-path>   — for queries
#   POST /api/mutation/<function-path> — for mutations
# Authentication: Clerk JWT in Authorization header (Bearer token)

scenarios:
  - name: "Dashboard Load — getDashboardStats"
    flow:
      - post:
          url: "/api/query/dashboard:getDashboardStats"
          json: {}
          capture:
            - json: "$.value"
              as: "stats"
      - think: 0.3
      - post:
          url: "/api/query/dashboard:getDashboardSummary"
          json: {}
      - think: 0.3
      - post:
          url: "/api/query/jobs:getMyJobs"
          json: {}