scripts/load-test/dashboard-load.yml
config:
  target: "{{ $processEnvironment.CONVEX_URL || $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 10
      arrivalRate: 100
      rampTo: 1000
      name: "Ramp up to 1k users/sec (10k concurrent)"
    - duration: 30
      arrivalRate: 1000
      name: "Sustain 1k users/sec for 30s"
  defaults:
    headers:
      Authorization: "Bearer {{ clerkToken }}"
      Content-Type: "application/json"
  http:
    timeout: 30
  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 5000
  payload:
    path: "scripts/load-test/test-users.csv"
    fields:
      - "userId"
      - "clerkToken"
    order: "random"
    skipHeader: true
    skipEmptyLines: true

# Convex exposes HTTP endpoints for all functions:
#   POST /api/query/<module>:<function>   — for queries
#   POST /api/mutation/<module>:<function> — for mutations
#
# Artillery resolves payload.path relative to the working directory, so run
# all commands from the project root (not from inside scripts/load-test/).
#
# Set your Convex URL via env var:
#   export CONVEX_URL=https://your-project.convex.cloud
#   export CLERK_SECRET_KEY='sk_test_...'
#   ./scripts/load-test/generate-test-users.sh 50
#   npx artillery run scripts/load-test/dashboard-load.yml

scenarios:
  - name: "Dashboard Load — getDashboardStats"
    flow:
      - post:
          url: "/api/query/dashboard:getDashboardStats"
          json: {}
          capture:
            - json: "$.value"
              as: "stats"
      - think: 0.3
      - post:
          url: "/api/query/dashboard:getDashboardSummary"
          json: {}
      - think: 0.3
      - post:
          url: "/api/query/jobs:getMyJobs"
          json: {}